Repository: poparab/jarz_pos_mobile
Catalog: lib/l10n/app_*.arb
Languages: ar

# appTitle
source: Jarz POS
ar: جارز لنقاط البيع

# drawerHeaderTitle
source: Jarz POS
ar: جارز لنقاط البيع

# drawerHeaderSubtitle
source: Mobile Point of Sale
ar: منصة نقاط البيع المحمولة

# menuPointOfSale
source: Point of Sale
ar: نقطة البيع

# menuSalesKanban
source: Sales Kanban
ar: لوحة المبيعات

# menuExpenses
source: Expenses
ar: المصروفات

# menuCourierBalances
source: Courier Balances
ar: أرصدة المندوبين

# menuManagerDashboard
source: Manager Dashboard
ar: لوحة تحكم المدير

# menuPurchaseInvoice
source: Purchase Invoice
ar: فواتير الشراء

# menuManufacturing
source: Manufacturing
ar: التصنيع

# menuStockTransfer
source: Stock Transfer
ar: تحويل المخزون

# menuCashTransfer
source: Cash Transfer
ar: تحويل النقدية

# menuInventoryCount
source: Inventory Count
ar: جرد المخزون

# menuHome
source: Home
ar: الرئيسية

# menuSettings
source: Settings
ar: الإعدادات

# menuLogout
source: Logout
ar: تسجيل الخروج

# menuLanguage
source: Language
ar: اللغة

# menuLanguageEnglish
source: English
ar: الإنجليزية

# menuLanguageArabic
source: Arabic
ar: العربية

# menuSelectedLanguage
source: Current language: {language}
ar: اللغة الحالية: {language}

# menuConfirmLanguage
source: Switch language to {language}?
ar: هل تريد تغيير اللغة إلى {language}؟

# commonConfirm
source: Confirm
ar: تأكيد

# commonCancel
source: Cancel
ar: إلغاء

# commonAdd
source: Add
ar: إضافة

# commonChoose
source: Choose
ar: اختر

# commonSearchItems
source: Search items
ar: ابحث عن الأصناف

# commonSearchSuppliers
source: Search suppliers
ar: ابحث عن الموردين

# commonNoItems
source: No items
ar: لا يوجد أصناف

# commonNoSuppliers
source: No suppliers
ar: لا يوجد موردون

# commonQtyLabel
source: Qty:
ar: الكمية:

# commonRateLabel
source: Rate:
ar: السعر:

# commonAmountValue
source: Amount: {amount}
ar: المبلغ: {amount}

# commonTotalValue
source: Total: {amount}
ar: الإجمالي: {amount}

# commonUomLabel
source: UOM:
ar: الوحدة:

# commonUomValue
source: UOM: {uom}
ar: الوحدة: {uom}

# commonContinue
source: Continue
ar: متابعة

# commonOk
source: OK
ar: حسنًا

# commonOnline
source: Online
ar: متصل

# commonOffline
source: Offline
ar: غير متصل

# commonError
source: Error
ar: خطأ

# commonErrorWithDetails
source: Error: {details}
ar: خطأ: {details}

# commonSubmit
source: Submit
ar: إرسال

# commonClose
source: Close
ar: إغلاق

# commonRetry
source: Retry
ar: إعادة المحاولة

# commonQtyWithUom
source: Qty ({uom})
ar: الكمية ({uom})

# expensesTitle
source: Expenses
ar: المصروفات

# expensesRefreshTooltip
source: Refresh
ar: تحديث

# expensesNewExpense
source: New Expense
ar: مصروف جديد

# expensesRecorded
source: Expense recorded
ar: تم تسجيل المصروف

# expensesSubmitted
source: Expense submitted for approval
ar: تم إرسال المصروف لاعتماد المدير

# expensesMonthLabel
source: Month
ar: الشهر

# expensesMonthCurrent
source: Current Month
ar: الشهر الحالي

# expensesEmptyTitle
source: No expenses recorded for this month.
ar: لا توجد مصروفات مسجلة لهذا الشهر.

# expensesEmptyManagerBody
source: Use the New Expense button to log team spending.
ar: استخدم زر مصروف جديد لتسجيل مصروفات الفريق.

# expensesEmptyStaffBody
source: Submit a request and a manager will review it shortly.
ar: أرسل الطلب وسيقوم المدير بمراجعته قريبًا.

# expensesFiltersClear
source: Clear filters
ar: مسح الفلاتر

# expensesFiltersTitle
source: Filter by payment method
ar: تصفية حسب طريقة الدفع

# expensesFiltersEmpty
source: No payment sources available
ar: لا يوجد مصادر دفع متاحة

# expensesSummaryTotal
source: Total
ar: الإجمالي

# expensesSummaryApproved
source: Approved
ar: المعتمدة

# expensesSummaryPending
source: Pending
ar: قيد الاعتماد

# expensesSummaryReceipts
source: {count} receipts
ar: {count} إثبات

# expensesReasonLabel
source: Reason (Indirect expense account)
ar: سبب الصرف (حساب مصروفات غير مباشرة)

# expensesPayFromLabel
source: Pay from
ar: الدفع من

# expensesAmountLabel
source: Amount
ar: القيمة

# expensesAmountHint
source: Enter amount
ar: أدخل القيمة

# expensesAmountInvalid
source: Enter a valid amount
ar: من فضلك أدخل قيمة صحيحة

# expensesDateLabel
source: Expense date
ar: تاريخ المصروف

# expensesRemarksLabel
source: Remarks (optional)
ar: ملاحظات (اختياري)

# expensesSubmitManager
source: Record expense
ar: تسجيل المصروف

# expensesSubmitStaff
source: Submit for approval
ar: إرسال للاعتماد

# expensesNoOptions
source: Expenses cannot be created until a reason and payment source are available.
ar: لا يمكن إنشاء مصروف قبل تفعيل حساب السبب وجهة الدفع.

# expensesApprove
source: Approve
ar: اعتماد

# expensesPendingStatus
source: Pending Approval
ar: قيد الاعتماد

# expensesApprovedStatus
source: Approved
ar: معتمد

# expensesDraftStatus
source: Draft
ar: مسودة

# expensesJournalEntry
source: Journal Entry
ar: قيد اليومية

# expensesPosProfile
source: POS Profile
ar: ملف نقطة البيع

# expensesPayingAccount
source: Paying account
ar: حساب الدفع

# expensesReasonAccount
source: Expense account
ar: حساب المصروف

# expensesTimelineTitle
source: Timeline
ar: الخط الزمني

# expensesTimelineEmpty
source: No timeline available
ar: لا يوجد سجل زمني

# expensesPullToRefresh
source: Pull to refresh
ar: اسحب للتحديث

# languageChanged
source: Language changed to {language}.
ar: تم تغيير اللغة إلى {language}.

# purchaseTitle
source: Purchase Invoice
ar: فاتورة شراء

# purchaseSupplierSectionTitle
source: Supplier
ar: المورد

# purchaseTapToPickSupplier
source: Tap to pick supplier
ar: اضغط لاختيار المورد

# purchaseItemsSectionTitle
source: Items
ar: الأصناف

# purchaseShippingLabel
source: Shipping (Freight & Forwarding):
ar: الشحن (مصاريف الشحن والمناولة):

# purchaseSubmit
source: Create Purchase Invoice
ar: إنشاء فاتورة شراء

# purchaseSelectSupplier
source: Select Supplier
ar: اختر المورد

# purchaseRecent
source: Recent
ar: الأحدث

# purchaseSupplierDisabledSuffix
source: (Disabled)
ar: (معطل)

# purchaseNoItemsInCart
source: No items in cart
ar: لا توجد أصناف في السلة

# purchaseCreated
source: Purchase created: {invoice}
ar: تم إنشاء فاتورة الشراء: {invoice}

# purchaseSubmitFailed
source: Purchase failed: {error}
ar: فشل إنشاء الفاتورة: {error}

# purchaseSelectPayment
source: Select Payment Source
ar: اختر مصدر الدفع

# purchasePaymentProfileSubtitle
source: Use exact-named POS Profile cash account
ar: استخدم حساب النقد المرتبط باسم ملف نقطة البيع

# purchasePaymentInstapayTitle
source: InstaPay (Bank)
ar: إنستا باي (بنك)

# purchasePaymentInstapaySubtitle
source: Use bank account mapped to InstaPay
ar: استخدم الحساب البنكي المرتبط بإنستا باي

# purchasePaymentCashTitle
source: Cash
ar: نقدي

# purchasePaymentCashSubtitle
source: Use company default Cash account
ar: استخدم حساب النقد الافتراضي للشركة

# posProfileSelectionTitle
source: Select POS Profile
ar: اختر ملف نقطة البيع

# posProfileSelectionErrorTitle
source: Error loading POS profiles
ar: تعذّر تحميل ملفات نقاط البيع

# posProfileSelectionNoProfilesTitle
source: No POS Profiles Available
ar: لا توجد ملفات نقاط بيع متاحة

# posProfileSelectionNoProfilesBody
source: Contact your administrator to assign you to a POS profile
ar: تواصل مع المسؤول لإسناد ملف نقطة بيع لك

# posProfileSelectionUnknownProfile
source: Unknown Profile
ar: ملف غير معروف

# posProfileSelectionWarehouseLabel
source: Warehouse: {warehouse}
ar: المخزن: {warehouse}

# posProfileSelectionPrompt
source: Choose a POS profile:
ar: اختر ملف نقطة البيع:

# posProfileSelectionCycleHint
source: Select POS
ar: اختر ملف نقطة البيع

# posProfileSelectionShortFallback
source: POS
ar: نقطة بيع

# posCartTitle
source: Shopping Cart
ar: سلة المشتريات

# posCartHeader
source: Cart ({count})
ar: السلة ({count})

# posCartClear
source: Clear cart
ar: إفراغ السلة

# posCartEmptyTitle
source: Cart is empty
ar: السلة فارغة

# posCartEmptyBody
source: Add items to get started
ar: أضف أصنافًا للبدء

# posCustomerUnselect
source: Remove customer
ar: إزالة العميل

# posCustomerAdd
source: Add customer
ar: إضافة عميل

# posCustomerDeliveryIncomeValue
source: Delivery income: {amount}
ar: إيراد التوصيل: {amount}

# posUnknownCustomer
source: Unknown Customer
ar: عميل غير معروف

# posCartPickupTitle
source: Pickup (no delivery fee)
ar: استلام من الفرع (بدون رسوم توصيل)

# posCartPickupDescription
source: Customer will collect the order from branch.
ar: سيستلم العميل الطلب من الفرع.

# posCartDeliveryDescription
source: Deliver to customer at selected time.
ar: سيوصل الطلب للعميل في الوقت المحدد.

# posCartPickupChip
source: Pickup
ar: استلام

# posSubtotalLabel
source: Subtotal:
ar: الإجمالي الفرعي:

# posDeliveryLabel
source: Delivery:
ar: التوصيل:

# posTotalLabel
source: Total:
ar: الإجمالي:

# posCheckoutButton
source: Checkout
ar: إتمام الطلب

# posOperationalInfoTitle
source: Operational Info
ar: معلومات تشغيلية

# posDeliveryExpenseLabel
source: Delivery Expense:
ar: تكلفة التوصيل:

# posDeliveryCostTo
source: Cost to {territory}
ar: تكلفة التوصيل إلى {territory}

# posDeliveryCostGeneric
source: Cost to deliver
ar: تكلفة التوصيل

# posUnknownItem
source: Unknown Item
ar: صنف غير معروف

# posCartEditBundle
source: Edit Bundle
ar: تعديل الباقة

# posCartClearTitle
source: Clear Cart
ar: إفراغ السلة

# posCartClearMessage
source: Are you sure you want to remove all items from the cart?
ar: هل أنت متأكد من حذف جميع الأصناف من السلة؟

# posCartClearConfirm
source: Clear
ar: إفراغ

# posDeliverySelectSlot
source: Please select a delivery time
ar: من فضلك اختر وقت التوصيل

# posDeliveryDialogTitle
source: Select Delivery Time
ar: اختر وقت التوصيل

# posDeliveryLoadFailed
source: Failed to load delivery slots
ar: فشل تحميل مواعيد التوصيل

# posDeliveryEmptyTitle
source: No delivery slots available
ar: لا توجد مواعيد توصيل متاحة

# posDeliveryEmptyBody
source: Please check the POS profile timetable configuration
ar: برجاء مراجعة جدول مواعيد ملف نقطة البيع

# posDeliveryDefaultChip
source: Next
ar: التالي

# posDeliveryLoading
source: Loading delivery slots...
ar: جارٍ تحميل مواعيد التوصيل...

# posDeliveryFieldLabel
source: Delivery Time
ar: وقت التوصيل

# posDeliveryErrorLabel
source: Error loading slots
ar: خطأ في تحميل المواعيد

# posDeliveryNoSlotsLabel
source: No slots available
ar: لا توجد مواعيد متاحة

# posDeliverySelectPrompt
source: Select delivery time
ar: اختر وقت التوصيل

# posSalesPartnerPaymentTitle
source: Sales Partner Payment
ar: دفع شريك المبيعات

# posSalesPartnerPaymentDescription
source: Choose how the sales partner is paying for this order.
ar: اختر طريقة دفع شريك المبيعات لهذا الطلب.

# posSalesPartnerPaymentCash
source: Cash (collected now)
ar: نقدًا (يُحصّل الآن)

# posSalesPartnerPaymentOnline
source: Online (already paid)
ar: أونلاين (تم الدفع بالفعل)

# posCheckoutSuccess
source: Order placed successfully!
ar: تم إرسال الطلب بنجاح!

# posCheckoutFailed
source: Failed to place order: {error}
ar: فشل إرسال الطلب: {error}

# posBundleContentsTitle
source: Bundle Contents:
ar: محتوى الباقة:

# posBundleUpdated
source: Bundle updated successfully!
ar: تم تحديث الباقة بنجاح!

# printerStatusBle
source: Printer: BLE
ar: الطابعة: بلوتوث LE

# printerStatusClassic
source: Printer: Classic
ar: الطابعة: بلوتوث كلاسيكي

# printerStatusConnecting
source: Printer: Connecting…
ar: الطابعة: جاري الاتصال…

# printerStatusError
source: Printer Error
ar: خطأ في الطابعة

# printerStatusDisconnected
source: Printer: Not Connected
ar: الطابعة: غير متصلة

# branchFilterTitle
source: Filter Branches
ar: تصفية الفروع

# branchFilterAllBranches
source: All Branches
ar: جميع الفروع

# branchFilterApply
source: Apply
ar: تطبيق

# websocketCollectCashTitle
source: Collect Cash
ar: تحصيل النقدية

# websocketCollectCashMessage
source: Collect the full order amount now from the Sales Partner courier.
ar: حصّل كامل قيمة الطلب الآن من مندوب المبيعات.

# websocketInvoiceLabel
source: Invoice: {invoice}
ar: الفاتورة: {invoice}

# systemStatusChecking
source: Checking...
ar: جاري الفحص...

# systemStatusRealtime
source: Real-time
ar: تحديث فوري

# systemStatusNoRealtime
source: No real-time
ar: بدون تحديث فوري

# systemStatusSynced
source: Synced
ar: تمت المزامنة

# systemStatusPendingCount
source: {count} pending
ar: {count} قيد المزامنة

# systemStatusCouriers
source: Couriers
ar: المندوبون

# systemStatusCourierCount
source: {count} couriers
ar: {count} مندوب

# systemStatusPartnerChip
source: Partner
ar: شريك

# systemStatusSalesPartnerFallback
source: Sales Partner
ar: شريك المبيعات

# systemStatusSyncComplete
source: Sync completed & couriers refreshed
ar: تمت المزامنة وتحديث بيانات المندوبين

# systemStatusForceSyncTooltip
source: Force sync now
ar: تنفيذ مزامنة فورية

# courierBalancesTitle
source: Courier Balances
ar: أرصدة المندوبين

# courierBalancesEmpty
source: No couriers found.
ar: لا يوجد مندوبون.

# courierBalancesSettledLabel
source: Settled
ar: مُسوى

# courierBalancesPayCourierLabel
source: Pay courier
ar: سدد للمندوب

# courierBalancesCourierPaysUsLabel
source: Courier pays us
ar: المندوب يسدد لنا

# courierBalancesDetailsTitle
source: Details – {courier}
ar: التفاصيل – {courier}

# courierBalancesCityOrderLine
source: City: {city} Order: {order} • Shipping: {shipping}
ar: المدينة: {city} الطلب: {order} • الشحن: {shipping}

# courierBalancesNetLabel
source: Net
ar: الصافي

# courierBalancesPreviewTooltip
source: Preview settlement
ar: معاينة التسوية

# courierBalancesPreviewFailed
source: Failed to load settlement preview: {error}
ar: فشل تحميل معاينة التسوية: {error}

# manufacturingTitle
source: Manufacturing
ar: التصنيع

# manufacturingManagersOnly
source: Managers only
ar: للمدراء فقط

# manufacturingRecentWorkOrdersTooltip
source: Recent Work Orders
ar: أوامر العمل الأخيرة

# manufacturingSearchDefaultBom
source: Search items with Default BOM
ar: ابحث عن الأصناف ذات الـ BOM الافتراضي

# manufacturingWorkOrdersTitle
source: Work Orders ({count})
ar: أوامر العمل ({count})

# manufacturingSubmitAll
source: Submit All
ar: إرسال الكل

# manufacturingNoItemsSelected
source: No items selected
ar: لا توجد أصناف محددة

# manufacturingNoItemsFound
source: No items found
ar: لا يوجد أصناف

# manufacturingBomDescription
source: BOM: {bom} • Yields {quantity} {uom}
ar: BOM: {bom} • ناتج {quantity} {uom}

# manufacturingRequiredItems
source: Required Items
ar: الأصناف المطلوبة

# manufacturingNothingToSubmit
source: Nothing to submit.
ar: لا يوجد ما يتم إرساله.

# manufacturingSubmittingWorkOrders
source: Submitting work orders...
ar: جاري إنشاء أوامر العمل...

# manufacturingSubmitFailed
source: Submit failed: {error}
ar: فشل الإرسال: {error}

# manufacturingSubmitAllSuccess
source: Submitted successfully
ar: تم الإرسال بنجاح

# manufacturingSubmitAllResult
source: Processed {total} line(s). Success: {success}
ar: تمت معالجة {total} بند. الناجحة: {success}

# manufacturingQuantityMustBePositive
source: Quantity must be greater than zero
ar: يجب أن تكون الكمية أكبر من صفر

# manufacturingSubmittingSingleWorkOrder
source: Submitting work order...
ar: جاري إنشاء أمر العمل...

# manufacturingSubmitResult
source: Submitted
ar: تم الإرسال

# manufacturingSubmitStatus
source: Status: {status}
ar: الحالة: {status}

# manufacturingSubmitWorkOrder
source: • WO: {workOrder}
ar: • رقم الأمر: {workOrder}

# manufacturingLoadFailed
source: Failed to load: {error}
ar: فشل التحميل: {error}

# manufacturingRecentWorkOrdersTitle
source: Recent Work Orders
ar: أوامر العمل الأخيرة

# manufacturingNoWorkOrders
source: No Work Orders found
ar: لا توجد أوامر عمل

# manufacturingComponentAvailable
source: Available: {quantity} {uom}
ar: المتوفر: {quantity} {uom}

# stockTransferTitle
source: Stock Transfer
ar: تحويل مخزون

# stockTransferManagersOnly
source: Managers only
ar: للمدراء فقط

# stockTransferLinesTitle
source: Transfer Lines ({count})
ar: بنود التحويل ({count})

# stockTransferPostingChip
source: Posting: {date}
ar: الترحيل: {date}

# stockTransferSubmit
source: Submit
ar: إرسال

# stockTransferProfilesMustDiffer
source: Source and Target must differ
ar: يجب أن يكون المصدر والوجهة مختلفين

# stockTransferProfileLabelSource
source: Source
ar: المصدر

# stockTransferProfileLabelTarget
source: Target
ar: الوجهة

# stockTransferProfilePlaceholder
source: Select POS Profile
ar: اختر ملف نقطة البيع

# stockTransferProfileWarehouseFallback
source: No warehouse
ar: بدون مخزن

# stockTransferSelectBranches
source: Select source and target branches
ar: اختر فروع المصدر والوجهة

# stockTransferSameProfile
source: Source and Target cannot be the same
ar: لا يمكن أن يكون المصدر والوجهة متطابقين

# stockTransferAvailability
source: Src: {source} • Dst: {target}
ar: المصدر: {source} • الوجهة: {target}

# stockTransferReservedSource
source: • Res Src: {reservedSource}
ar: • محجوز مصدر: {reservedSource}

# stockTransferReservedTarget
source: • Res Dst: {reservedTarget}
ar: • محجوز وجهة: {reservedTarget}

# stockTransferPosTag
source: • POS
ar: • نقطة بيع

# stockTransferPostingToday
source: Posting Date: Today
ar: تاريخ الترحيل: اليوم

# stockTransferPostingDate
source: Posting Date: {date}
ar: تاريخ الترحيل: {date}

# stockTransferUseToday
source: Use Today
ar: استخدم اليوم

# stockTransferNoLines
source: No lines
ar: لا يوجد بنود

# stockTransferBeforeBase
source: Before — Src: {source} • Dst: {target}
ar: قبل — المصدر: {source} • الوجهة: {target}

# stockTransferAfterBase
source: After — Src: {source} • Dst: {target}
ar: بعد — المصدر: {source} • الوجهة: {target}

# stockTransferTransferCreated
source: Transfer created: {stockEntry}
ar: تم إنشاء التحويل: {stockEntry}

# stockTransferSubmitFailed
source: Failed: {error}
ar: فشل: {error}

# stockTransferBulkAddFailed
source: Bulk add failed: {error}
ar: فشل الإضافة الجماعية: {error}

# stockTransferQuickQuantity
source: Quick quantity
ar: كمية سريعة

# stockTransferQuantityPerItem
source: Quantity for each item
ar: الكمية لكل صنف

# stockTransferItemGroup
source: Item Group
ar: مجموعة الأصناف

# stockTransferAllGroups
source: All Groups
ar: كل المجموعات

# stockTransferAddAll
source: Add All
ar: إضافة الكل

# stockTransferAddGroup
source: Add Group
ar: إضافة المجموعة
